<a href="https://colab.research.google.com/github/johnwesleyharding/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/JWH_assignment_DS_113_Join_and_Reshape_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-03 03:34:12--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.0.166
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.0.166|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  60.4MB/s    in 3.2s

2019-10-03 03:34:16 (60.4 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order1 = pd.read_csv('order_products__prior.csv')
order2 = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [6]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [7]:
order1.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
order2.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
order3 = pd.concat([order1, order2])

In [10]:
order3.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
order3.tail()

         order_id  product_id  add_to_cart_order  reordered
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

In [12]:
order3['product_id'].value_counts()

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
27966    142603
22935    117716
24964    113936
45007    109412
39275    105026
49683     99728
28204     92889
5876      91251
40706     88078
8277      87272
4920      86748
30391     85005
45066     83320
42265     80493
44632     79245
49235     79006
19057     78056
4605      76929
21616     75752
37646     75655
          ...
6786          1
39522         1
46278         1
43098         1
34463         1
45273         1
47680         1
3426          1
13397         1
7712          1
49540         1
16790         1
44982         1
38045         1
42464         1
25888         1
48211         1
20223         1
28504         1
44986         1
41800         1
9818          1
15901         1
7198          1
33097         1
42235         1
5255          1
44495         1
36079         1
20759         1
Name: product_id, Length: 49685, dtype: int64

In [13]:
print(order3.shape, products.shape)

(33819106, 4) (49688, 4)

In [14]:
order3.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
order3.drop(['add_to_cart_order', 'reordered'], axis = 1, inplace = True)

In [16]:
order3.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [17]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
products.drop(['aisle_id', 'department_id'], axis = 1, inplace = True)

In [19]:
products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [20]:
merged = pd.merge(order3, products, how = 'inner', on = 'product_id')
merged.head()

   order_id  product_id        product_name
0         2       33120  Organic Egg Whites
1        26       33120  Organic Egg Whites
2       120       33120  Organic Egg Whites
3       327       33120  Organic Egg Whites
4       390       33120  Organic Egg Whites

In [0]:
popular = merged['product_name'].value_counts()

In [22]:
type(popular)

pandas.core.series.Series

In [23]:
popular = pd.DataFrame(popular).reset_index()
popular.head()

                    index  product_name
0                  Banana        491291
1  Bag of Organic Bananas        394930
2    Organic Strawberries        275577
3    Organic Baby Spinach        251705
4    Organic Hass Avocado        220877

In [24]:
type(popular)

pandas.core.frame.DataFrame

In [25]:
popular.columns = ['product_name', 'times_ordered']
popular.head()

             product_name  times_ordered
0                  Banana         491291
1  Bag of Organic Bananas         394930
2    Organic Strawberries         275577
3    Organic Baby Spinach         251705
4    Organic Hass Avocado         220877

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import numpy as np

In [27]:
table1 = pd.DataFrame(
 [[np.nan, 2],
  [16, 11],
  [3, 1]],
  index = ['John Smith', 'Jane Doe', 'Mary Johnson'],
  columns = ['treatmenta', 'treatmentb'])

table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [28]:
table2.index.tolist()
table2.columns.tolist()
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [29]:
tidy = table2.melt(id_vars = 'index', value_vars = 
                   ['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [30]:
tall = tidy.pivot_table(index = 'index', columns = 'variable', values = 'value')
tall

variable    Jane Doe  John Smith  Mary Johnson
index
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')
#Load seaborn's flights dataset by running the cell below. 
#Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. 
#You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [32]:
print(flights.shape)
flights.head()

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [33]:
full = flights.pivot_table(index = 'year', columns = 'month', values = 'passengers')
full

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [34]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [35]:
subset = orders.loc[:,['order_id', 'order_hour_of_day']]
subset.head()

   order_id  order_hour_of_day
0   2539329                  8
1   2398795                  7
2    473747                 12
3   2254736                  7
4    431534                 15

In [36]:
subset2 = popular.loc[popular['times_ordered'] > 2900,:]
subset2.head()

             product_name  times_ordered
0                  Banana         491291
1  Bag of Organic Bananas         394930
2    Organic Strawberries         275577
3    Organic Baby Spinach         251705
4    Organic Hass Avocado         220877

In [37]:
merged2 = pd.merge(subset2, merged, how = 'inner', on = 'product_name')
merged2.head()

  product_name  times_ordered  order_id  product_id
0       Banana         491291        10       24852
1       Banana         491291        20       24852
2       Banana         491291        22       24852
3       Banana         491291        26       24852
4       Banana         491291        52       24852

In [38]:
merged3 = pd.merge(merged2, subset, how = 'inner', on = 'order_id')
merged3.head()

           product_name  times_ordered  order_id  product_id  order_hour_of_day
0                Banana         491291        10       24852                  8
1  Organic Strawberries         275577        10       21137                  8
2       Organic Avocado         184224        10       47766                  8
3   Organic Half & Half          79006        10       49235                  8
4         Yellow Onions          76929        10        4605                  8

In [39]:
print(merged3.shape, order3.shape)

(22450886, 5) (33819106, 2)

In [0]:
merged3.drop(['times_ordered', 'product_id'], axis = 1, inplace = True)

In [41]:
merged3.head()

           product_name  order_id  order_hour_of_day
0                Banana        10                  8
1  Organic Strawberries        10                  8
2       Organic Avocado        10                  8
3   Organic Half & Half        10                  8
4         Yellow Onions        10                  8

In [43]:
merged3.sort_values('product_name', inplace = True)
merged3.head()

                      product_name  order_id  order_hour_of_day
7717258   0% Fat Free Organic Milk   2462408                 12
13716323  0% Fat Free Organic Milk   2985303                 14
679247    0% Fat Free Organic Milk    490205                 12
19022958  0% Fat Free Organic Milk   2237725                 21
21349154  0% Fat Free Organic Milk   2051097                 17

In [0]:
names = merged3['product_name'].unique().tolist()

In [0]:
def averagehour(foodlist):
  hours = []
  for i in range(len(foodlist)):
    hours.append(merged3[merged3['product_name'] == foodlist[i]]['order_hour_of_day'].mean())
  return hours

In [0]:
foodhours = averagehour(names)

In [0]:
answer = pd.DataFrame(foodhours, names)

In [58]:
answer.sort_values(0, ascending = False, inplace = True)
answer.head(25)

                                                      0
Half Baked Frozen Yogurt                      14.526986
The Tonight Dough™ Ice Cream                  14.526299
Americone Dream® Ice Cream                    14.394912
Half Baked® Ice Cream                         14.388942
Phish Food® Ice Cream                         14.373308
Milk and Cookies Ice Cream                    14.369711
Sicilian Pistachio                            14.306421
Chocolate Peanut Butter Cup Gelato            14.303480
Birthday Cake Light Ice Cream                 14.292018
Cherry Garcia Ice Cream                       14.270300
Strawberry Ice Cream                          14.268841
Vanilla Bean Light Ice Cream                  14.257849
Coffee Ice Cream                              14.256280
Roman Raspberry Sorbetto                      14.248191
Mediterranean Mint Gelato                     14.233542
Caramel Cookie Crunch Gelato                  14.224069
Chocolate Chip Cookie Dough Ice Cream         14.204325
Mint Chip                                     14.189235
Coconut Almond Minis Frozen Dessert Bars      14.156069
Mint Chocolate Chip Ice Cream                 14.134992
Chocolate Peanut Butter Ice Cream             14.120449
Vanilla Milk Chocolate Almond Ice Cream Bars  14.104662
Sea Salt Caramel Gelato                       14.083895
Vanilla Bean Ice Cream                        14.039406
Rising Crust Pepperoni Pizza                  14.027699

In [42]:
#final = merged3.pivot_table(index = 'order_id', columns = 'product_name', values = 'order_hour_of_day')
#final.head()

ValueError: ignored

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
table1